# Abdullah Oluwatobi Salami Pandas Review Challenge

To review some basic concepts, attempt to perform these basic Pandas tasks on your own. The answer to each question is in cell after the question. Be careful not to run the answer cells. Because this will clear out all the answers. Rather, add new cells to do your explorations.

Q1 has been solved for you.

Import `numpy as np`, `pandas as pd`, and check your pandas version.

In [1]:
import numpy as np
import pandas as pd
print(pd.__version__) # your version may be different


pd.set_option('display.max_columns', None)

2.2.3

## Series

**Q1:** Create a Pandas Series object called `Q1` from the following `arr` array.

In [2]:
arr = np.array([4,8,-3,1])

#Pandas Series object
Q1 = pd.Series(arr)
Q1

0    4
1    8
2   -3
3    1
dtype: int32

**Q2:** Create a Pandas Series object called `Q2` from the above `arr` array with an index of `a`, `b`, `c`, `d`.

In [3]:
# WRITE CODE HERE THAT REPRODUCES THE OUTPUT OF THE CELL BELOW
# BE CAREFUL NOT TO RUN THE CELL BELOW, OTHERWISE YOU WON'T BE ABLE TO SEE THE OUTPUT ANY MORE
# IF YOU NEED MORE CODE CELLS, YOU CAN ADD MORE BEFORE THE ANSWER CELL

labels = ['a','b','c','d']
Q2 = pd.Series(arr, index= labels)
Q2

a    4
b    8
c   -3
d    1
dtype: int32

In [ ]:
#ANSWER CELL: DO NOT RUN THIS CELL. YOUR ANSWER MUST MATCH THIS.

a    4
b    8
c   -3
d    1
dtype: int32

**Q3:** Index the `c` instance for the `Q2` Series and save it as `Q3`.

In [4]:
# WRITE CODE HERE THAT REPRODUCES THE OUTPUT OF THE CELL BELOW
# BE CAREFUL NOT TO RUN THE CELL BELOW, OTHERWISE YOU WON'T BE ABLE TO SEE THE OUTPUT ANY MORE
# IF YOU NEED MORE CODE CELLS, YOU CAN ADD MORE BEFORE THE ANSWER CELL

Q3 = Q2['c']
print(Q3)

-3

In [ ]:
#ANSWER CELL: DO NOT RUN THIS CELL. YOUR ANSWER MUST MATCH THIS.

-3

**Q4:**  Make a copy of the `Q2` Series and call it `Q4`. Change the `c` instance in `Q4` to `0`.

In [5]:
# WRITE CODE HERE THAT REPRODUCES THE OUTPUT OF THE CELL BELOW
# BE CAREFUL NOT TO RUN THE CELL BELOW, OTHERWISE YOU WON'T BE ABLE TO SEE THE OUTPUT ANY MORE
# IF YOU NEED MORE CODE CELLS, YOU CAN ADD MORE BEFORE THE ANSWER CELL

Q4 = Q2.copy()
Q4['c'] = 0

In [6]:
Q4

a    4
b    8
c    0
d    1
dtype: int32

In [ ]:
#ANSWER CELL: DO NOT RUN THIS CELL. YOUR ANSWER MUST MATCH THIS.

a    4
b    8
c    0
d    1
dtype: int32

**Q5:** Filter all instances in `Q4` that are greater than `2` and save this as `Q5`.

In [7]:
# WRITE CODE HERE THAT REPRODUCES THE OUTPUT OF THE CELL BELOW
# BE CAREFUL NOT TO RUN THE CELL BELOW, OTHERWISE YOU WON'T BE ABLE TO SEE THE OUTPUT ANY MORE
# IF YOU NEED MORE CODE CELLS, YOU CAN ADD MORE BEFORE THE ANSWER CELL

Q5 = Q4[Q4 > 2]
print(Q5)

a    4
b    8
dtype: int32

In [ ]:
#ANSWER CELL: DO NOT RUN THIS CELL. YOUR ANSWER MUST MATCH THIS.

a    4
b    8
dtype: int32

**Q6:** Using a Python dictionary, create the following as a Series called `Q6` using the state as the index.
```
 Wyoming      581000
 Vermont      623000
 DC           714000
 Alaska       724000
 North Dakota 770000
```

In [8]:
# WRITE CODE HERE THAT REPRODUCES THE OUTPUT OF THE CELL BELOW
# BE CAREFUL NOT TO RUN THE CELL BELOW, OTHERWISE YOU WON'T BE ABLE TO SEE THE OUTPUT ANY MORE
# IF YOU NEED MORE CODE CELLS, YOU CAN ADD MORE BEFORE THE ANSWER CELL

In [9]:
Q6d = {
    'Wyoming': 581000,
    'Vermont': 623000,
    'DC': 714000,
    'Alaska': 724000,
    'North Dakota': 770000
}

Q6 = pd.Series(Q6d)
Q6

Wyoming         581000
Vermont         623000
DC              714000
Alaska          724000
North Dakota    770000
dtype: int64

In [ ]:
#ANSWER CELL: DO NOT RUN THIS CELL. YOUR ANSWER MUST MATCH THIS.

Wyoming         581000
Vermont         623000
DC              714000
Alaska          724000
North Dakota    770000
dtype: int64

**Q7:** Create a Series called `Q7` using the `states` dictionary above. Use the list `states2` below as the index. Take a look at the new Series. What do you notice?

In [10]:
states2=['Alaska','DC','North Dakota', 'South Dakota','Wyoming']

# WRITE CODE HERE THAT REPRODUCES THE OUTPUT OF THE CELL BELOW
# BE CAREFUL NOT TO RUN THE CELL BELOW, OTHERWISE YOU WON'T BE ABLE TO SEE THE OUTPUT ANY MORE
# IF YOU NEED MORE CODE CELLS, YOU CAN ADD MORE BEFORE THE ANSWER CELL

In [11]:
Q7 = pd.Series(Q6, index= states2)
Q7

Alaska          724000.0
DC              714000.0
North Dakota    770000.0
South Dakota         NaN
Wyoming         581000.0
dtype: float64

I noticed 4 things:
1. The values are in decimal format.
2. South Dakota is not assigned any value.
3. Vermont is missing.
4. It is arranged in alphabetical order.

In [ ]:
#ANSWER CELL: DO NOT RUN THIS CELL. YOUR ANSWER MUST MATCH THIS.

Alaska          724000.0
DC              714000.0
North Dakota    770000.0
South Dakota         NaN
Wyoming         581000.0
dtype: float64

**Q8:** What do you think will happen if we add `Q6` and `Q7` together? Add the two Series together and call the new Series `Q8`. Did it do what you expected?

In [12]:
# WRITE CODE HERE THAT REPRODUCES THE OUTPUT OF THE CELL BELOW
# BE CAREFUL NOT TO RUN THE CELL BELOW, OTHERWISE YOU WON'T BE ABLE TO SEE THE OUTPUT ANY MORE
# IF YOU NEED MORE CODE CELLS, YOU CAN ADD MORE BEFORE THE ANSWER CELL

Q8 = Q6 + Q7
Q8

Alaska          1448000.0
DC              1428000.0
North Dakota    1540000.0
South Dakota          NaN
Vermont               NaN
Wyoming         1162000.0
dtype: float64

Yes, it did as I expected. It added the values together.

In [ ]:
#ANSWER CELL: DO NOT RUN THIS CELL. YOUR ANSWER MUST MATCH THIS.

Alaska          1448000.0
DC              1428000.0
North Dakota    1540000.0
South Dakota          NaN
Vermont               NaN
Wyoming         1162000.0
dtype: float64

**Q9:** Perform the following tasks:
- make a copy of the `Q8` Series and call it `Q9`
- Drop the null values from `Q9`.
- Add a `name` attribute for the Series object as `population`.
- Add a `name` attribute for the index as `state`.

In [13]:
# WRITE CODE HERE THAT REPRODUCES THE OUTPUT OF THE CELL BELOW
# BE CAREFUL NOT TO RUN THE CELL BELOW, OTHERWISE YOU WON'T BE ABLE TO SEE THE OUTPUT ANY MORE
# IF YOU NEED MORE CODE CELLS, YOU CAN ADD MORE BEFORE THE ANSWER CELL

In [14]:
Q9 = Q8.copy()
Q9

Alaska          1448000.0
DC              1428000.0
North Dakota    1540000.0
South Dakota          NaN
Vermont               NaN
Wyoming         1162000.0
dtype: float64

In [15]:
Q9_nulldropped = Q9.dropna()
print(Q9_nulldropped)

Alaska          1448000.0
DC              1428000.0
North Dakota    1540000.0
Wyoming         1162000.0
dtype: float64

In [16]:
Q9_nulldropped.name = "population"

In [17]:
Q9_nulldropped.index.name = "state"
Q9_nulldropped

state
Alaska          1448000.0
DC              1428000.0
North Dakota    1540000.0
Wyoming         1162000.0
Name: population, dtype: float64

In [ ]:
#ANSWER CELL: DO NOT RUN THIS CELL. YOUR ANSWER MUST MATCH THIS.

state
Alaska          1448000.0
DC              1428000.0
North Dakota    1540000.0
Wyoming         1162000.0
Name: population, dtype: float64

## DataFrame

**Q10:** Using the below Python dictionary, create a DataFrame called `Q10`.

In [18]:
data = {'book':['The Way of Kings','A Game of Thrones','The Hobbit',
                "Harry Potter and the Sorcerer's Stone",'The Lion, the Witch, and the Wardrobe'],
        'year_published': [2010,1996,1937,1997,1950],
        'amazon_rating': [5,4.5,5,5,5]}
data

{'book': ['The Way of Kings',
  'A Game of Thrones',
  'The Hobbit',
  "Harry Potter and the Sorcerer's Stone",
  'The Lion, the Witch, and the Wardrobe'],
 'year_published': [2010, 1996, 1937, 1997, 1950],
 'amazon_rating': [5, 4.5, 5, 5, 5]}

In [19]:
# WRITE CODE HERE THAT REPRODUCES THE OUTPUT OF THE CELL BELOW
# BE CAREFUL NOT TO RUN THE CELL BELOW, OTHERWISE YOU WON'T BE ABLE TO SEE THE OUTPUT ANY MORE
# IF YOU NEED MORE CODE CELLS, YOU CAN ADD MORE BEFORE THE ANSWER CELL

In [20]:
Q10 = pd.DataFrame(data)

In [21]:
Q10

                                    book  year_published  amazon_rating
0                       The Way of Kings            2010            5.0
1                      A Game of Thrones            1996            4.5
2                             The Hobbit            1937            5.0
3  Harry Potter and the Sorcerer's Stone            1997            5.0
4  The Lion, the Witch, and the Wardrobe            1950            5.0

In [ ]:
#ANSWER CELL: DO NOT RUN THIS CELL. YOUR ANSWER MUST MATCH THIS.

                                    book  year_published  amazon_rating
0                       The Way of Kings            2010            5.0
1                      A Game of Thrones            1996            4.5
2                             The Hobbit            1937            5.0
3  Harry Potter and the Sorcerer's Stone            1997            5.0
4  The Lion, the Witch, and the Wardrobe            1950            5.0

**Q11:** Make a copy of the `Q10` DataFrame and call it `Q11`.  Add a fourth column called `copies_owned` and assign a scalar value of `1` to every row.

In [22]:
# WRITE CODE HERE THAT REPRODUCES THE OUTPUT OF THE CELL BELOW
# BE CAREFUL NOT TO RUN THE CELL BELOW, OTHERWISE YOU WON'T BE ABLE TO SEE THE OUTPUT ANY MORE
# IF YOU NEED MORE CODE CELLS, YOU CAN ADD MORE BEFORE THE ANSWER CELL

In [23]:
Q11 = Q10.copy()
Q11['copies_owned'] = 1
Q11

,book,year_published,amazon_rating,copies_owned
0,The Way of Kings,2010,5.0,1
1,A Game of Thrones,1996,4.5,1
2,The Hobbit,1937,5.0,1
3,Harry Potter and the Sorcerer's Stone,1997,5.0,1
4,"The Lion, the Witch, and the Wardrobe",1950,5.0,1

In [ ]:
#ANSWER CELL: DO NOT RUN THIS CELL. YOUR ANSWER MUST MATCH THIS.

,book,year_published,amazon_rating,copies_owned
0,The Way of Kings,2010,5.0,1
1,A Game of Thrones,1996,4.5,1
2,The Hobbit,1937,5.0,1
3,Harry Potter and the Sorcerer's Stone,1997,5.0,1
4,"The Lion, the Witch, and the Wardrobe",1950,5.0,1

**Q12:** Make a copy of `Q11` and call it `Q12`. Remove the fourth column called `copies_owned` for the `Q12` DataFrame.

In [24]:
# WRITE CODE HERE THAT REPRODUCES THE OUTPUT OF THE CELL BELOW
# BE CAREFUL NOT TO RUN THE CELL BELOW, OTHERWISE YOU WON'T BE ABLE TO SEE THE OUTPUT ANY MORE
# IF YOU NEED MORE CODE CELLS, YOU CAN ADD MORE BEFORE THE ANSWER CELL

In [25]:
Q12 = Q11.copy()
Q12

,book,year_published,amazon_rating,copies_owned
0,The Way of Kings,2010,5.0,1
1,A Game of Thrones,1996,4.5,1
2,The Hobbit,1937,5.0,1
3,Harry Potter and the Sorcerer's Stone,1997,5.0,1
4,"The Lion, the Witch, and the Wardrobe",1950,5.0,1

In [26]:
Q12 = Q12.drop('copies_owned', axis=1)
Q12

                                    book  year_published  amazon_rating
0                       The Way of Kings            2010            5.0
1                      A Game of Thrones            1996            4.5
2                             The Hobbit            1937            5.0
3  Harry Potter and the Sorcerer's Stone            1997            5.0
4  The Lion, the Witch, and the Wardrobe            1950            5.0

In [ ]:
#ANSWER CELL: DO NOT RUN THIS CELL. YOUR ANSWER MUST MATCH THIS.

                                    book  year_published  amazon_rating
0                       The Way of Kings            2010            5.0
1                      A Game of Thrones            1996            4.5
2                             The Hobbit            1937            5.0
3  Harry Potter and the Sorcerer's Stone            1997            5.0
4  The Lion, the Witch, and the Wardrobe            1950            5.0

**Q13:** Create a DataFrame called `Q13` using the below nested dictionary of dictionaries. (Note: outer keys are interpreted as columns, inner keys as row indices)

In [27]:
pop = {'Nevada':{2001: 2.4, 2002: 2.9},
      'Ohio': {2000:1.5, 2001: 1.7, 2002: 3.6}}

In [28]:
# WRITE CODE HERE THAT REPRODUCES THE OUTPUT OF THE CELL BELOW
# BE CAREFUL NOT TO RUN THE CELL BELOW, OTHERWISE YOU WON'T BE ABLE TO SEE THE OUTPUT ANY MORE
# IF YOU NEED MORE CODE CELLS, YOU CAN ADD MORE BEFORE THE ANSWER CELL

In [29]:
Q13 = pd.DataFrame(pop)

In [30]:
Q13

      Nevada  Ohio
2001     2.4   1.7
2002     2.9   3.6
2000     NaN   1.5

In [ ]:
#ANSWER CELL: DO NOT RUN THIS CELL. YOUR ANSWER MUST MATCH THIS.

      Nevada  Ohio
2000     NaN   1.5
2001     2.4   1.7
2002     2.9   3.6

**Q14:** Swap the columns and rows of `Q13` by using the transpose method `.T` and save this as `Q14`.

In [31]:
# WRITE CODE HERE THAT REPRODUCES THE OUTPUT OF THE CELL BELOW
# BE CAREFUL NOT TO RUN THE CELL BELOW, OTHERWISE YOU WON'T BE ABLE TO SEE THE OUTPUT ANY MORE
# IF YOU NEED MORE CODE CELLS, YOU CAN ADD MORE BEFORE THE ANSWER CELL

In [32]:
Q14 = Q13.T
Q14

        2001  2002  2000
Nevada   2.4   2.9   NaN
Ohio     1.7   3.6   1.5

In [ ]:
#ANSWER CELL: DO NOT RUN THIS CELL. YOUR ANSWER MUST MATCH THIS.

        2000  2001  2002
Nevada   NaN   2.4   2.9
Ohio     1.5   1.7   3.6

**Q15:** Change the columns in the `Q14` DataFrame to be in year order (earlier to later) and save this as `Q15`.

In [33]:
# WRITE CODE HERE THAT REPRODUCES THE OUTPUT OF THE CELL BELOW
# BE CAREFUL NOT TO RUN THE CELL BELOW, OTHERWISE YOU WON'T BE ABLE TO SEE THE OUTPUT ANY MORE
# IF YOU NEED MORE CODE CELLS, YOU CAN ADD MORE BEFORE THE ANSWER CELL

In [34]:
Q15 = Q14[sorted(Q14.columns)]
Q15

        2000  2001  2002
Nevada   NaN   2.4   2.9
Ohio     1.5   1.7   3.6

In [ ]:
#ANSWER CELL: DO NOT RUN THIS CELL. YOUR ANSWER MUST MATCH THIS.

        2000  2001  2002
Nevada   NaN   2.4   2.9
Ohio     1.5   1.7   3.6

**Q16:** Index only `Nevada` in the `Q15` DataFrame and save this as `Q16`.

In [35]:
# WRITE CODE HERE THAT REPRODUCES THE OUTPUT OF THE CELL BELOW
# BE CAREFUL NOT TO RUN THE CELL BELOW, OTHERWISE YOU WON'T BE ABLE TO SEE THE OUTPUT ANY MORE
# IF YOU NEED MORE CODE CELLS, YOU CAN ADD MORE BEFORE THE ANSWER CELL

In [37]:
Q16 = Q15.loc['Nevada']
Q16

2000    NaN
2001    2.4
2002    2.9
Name: Nevada, dtype: float64

In [ ]:
#ANSWER CELL: DO NOT RUN THIS CELL. YOUR ANSWER MUST MATCH THIS.

2000    NaN
2001    2.4
2002    2.9
Name: Nevada, dtype: float64

**Q17:** Select the `2001` column from the `Q15` DataFrame and save this as `Q17`.

In [38]:
# WRITE CODE HERE THAT REPRODUCES THE OUTPUT OF THE CELL BELOW
# BE CAREFUL NOT TO RUN THE CELL BELOW, OTHERWISE YOU WON'T BE ABLE TO SEE THE OUTPUT ANY MORE
# IF YOU NEED MORE CODE CELLS, YOU CAN ADD MORE BEFORE THE ANSWER CELL

In [40]:
Q17 = Q15[2001]
Q17

Nevada    2.4
Ohio      1.7
Name: 2001, dtype: float64

In [ ]:
#ANSWER CELL: DO NOT RUN THIS CELL. YOUR ANSWER MUST MATCH THIS.

Nevada    2.4
Ohio      1.7
Name: 2001, dtype: float64

**Q18:**  Select the `Ohio` row and the `2001` and `2002` columns from `Q15` and save this as `Q18`.

In [41]:
# WRITE CODE HERE THAT REPRODUCES THE OUTPUT OF THE CELL BELOW
# BE CAREFUL NOT TO RUN THE CELL BELOW, OTHERWISE YOU WON'T BE ABLE TO SEE THE OUTPUT ANY MORE
# IF YOU NEED MORE CODE CELLS, YOU CAN ADD MORE BEFORE THE ANSWER CELL

In [42]:
Q18 = Q15.loc['Ohio', [2001, 2002]]
Q18

2001    1.7
2002    3.6
Name: Ohio, dtype: float64

In [ ]:
#ANSWER CELL: DO NOT RUN THIS CELL. YOUR ANSWER MUST MATCH THIS.

2001    1.7
2002    3.6
Name: Ohio, dtype: float64

**Q19:** Load the `employees` DataFrame. Filter only the employees that make above $90,000 and save this as `Q19`.

In [43]:
table =  {'name': ['John', 'Jane', 'Billy', 'Tracy'],
         'age': [25, 27, 42, 31],
          'gender': ['M','F','M','F'],
         'profession': ['Developer', 'Analyst', 'Admin', 'Data Scientist'],
         'salary':[100000, 80000, 75000, 110000]
         }
employees = pd.DataFrame(table)
employees

    name  age gender      profession  salary
0   John   25      M       Developer  100000
1   Jane   27      F         Analyst   80000
2  Billy   42      M           Admin   75000
3  Tracy   31      F  Data Scientist  110000

In [47]:
# WRITE CODE HERE THAT REPRODUCES THE OUTPUT OF THE CELL BELOW
# BE CAREFUL NOT TO RUN THE CELL BELOW, OTHERWISE YOU WON'T BE ABLE TO SEE THE OUTPUT ANY MORE
# IF YOU NEED MORE CODE CELLS, YOU CAN ADD MORE BEFORE THE ANSWER CELL

Q19 =employees[employees['salary'] > 90000]
Q19

    name  age gender      profession  salary
0   John   25      M       Developer  100000
3  Tracy   31      F  Data Scientist  110000

In [ ]:
#ANSWER CELL: DO NOT RUN THIS CELL. YOUR ANSWER MUST MATCH THIS.

    name  age gender      profession  salary
0   John   25      M       Developer  100000
3  Tracy   31      F  Data Scientist  110000

**Q20:** Select only the names of the employees that make under $90,000 and save this as `Q20`.

In [60]:
# WRITE CODE HERE THAT REPRODUCES THE OUTPUT OF THE CELL BELOW
# BE CAREFUL NOT TO RUN THE CELL BELOW, OTHERWISE YOU WON'T BE ABLE TO SEE THE OUTPUT ANY MORE
# IF YOU NEED MORE CODE CELLS, YOU CAN ADD MORE BEFORE THE ANSWER CELL

Q20 = employees.loc[employees['salary'] < 90000, 'name']
Q20

1     Jane
2    Billy
Name: name, dtype: object

In [ ]:
#ANSWER CELL: DO NOT RUN THIS CELL. YOUR ANSWER MUST MATCH THIS.

1     Jane
2    Billy
Name: name, dtype: object

**Q21:** Select only the names of the employees that make under $90,000 and are over 30 years old.  Save this as `Q21`.

In [69]:
# WRITE CODE HERE THAT REPRODUCES THE OUTPUT OF THE CELL BELOW
# BE CAREFUL NOT TO RUN THE CELL BELOW, OTHERWISE YOU WON'T BE ABLE TO SEE THE OUTPUT ANY MORE
# IF YOU NEED MORE CODE CELLS, YOU CAN ADD MORE BEFORE THE ANSWER CELL

Q21 = employees.loc[(employees['salary'] < 90000) & (employees['age'] > 30), 'name']
Q21

2    Billy
Name: name, dtype: object

In [ ]:
#ANSWER CELL: DO NOT RUN THIS CELL. YOUR ANSWER MUST MATCH THIS.

2    Billy
Name: name, dtype: object

**Q22:** Our company has grown, and we have hired three new employees. Create a new DataFrame called `Q22` that adds these employees (`new_hires`) to the original DataFrame `employees`. Make sure that the index for the new DataFrame is labeled as `0` - `n-1`.

In [74]:
new_hires = {'name': ['Emily','Lukas','Janelle'],
            'age': [22, np.nan, 52],
             'gender': ['F','M','F'],
            'profession': ['Project Manager','ML Engineer','CIO'],
            'salary': [np.nan,135000,230000]}

new_hires_dataframe = pd.DataFrame(new_hires)

### ENTER CODE HERE ###

# WRITE CODE HERE THAT REPRODUCES THE OUTPUT OF THE CELL BELOW
# BE CAREFUL NOT TO RUN THE CELL BELOW, OTHERWISE YOU WON'T BE ABLE TO SEE THE OUTPUT ANY MORE
# IF YOU NEED MORE CODE CELLS, YOU CAN ADD MORE BEFORE THE ANSWER CELL

Q22 = pd.concat([employees, new_hires_dataframe], ignore_index= True)
Q22

      name   age gender       profession    salary
0     John  25.0      M        Developer  100000.0
1     Jane  27.0      F          Analyst   80000.0
2    Billy  42.0      M            Admin   75000.0
3    Tracy  31.0      F   Data Scientist  110000.0
4    Emily  22.0      F  Project Manager       NaN
5    Lukas   NaN      M      ML Engineer  135000.0
6  Janelle  52.0      F              CIO  230000.0

In [ ]:
#ANSWER CELL: DO NOT RUN THIS CELL. YOUR ANSWER MUST MATCH THIS.

      name   age gender       profession    salary
0     John  25.0      M        Developer  100000.0
1     Jane  27.0      F          Analyst   80000.0
2    Billy  42.0      M            Admin   75000.0
3    Tracy  31.0      F   Data Scientist  110000.0
4    Emily  22.0      F  Project Manager       NaN
5    Lukas   NaN      M      ML Engineer  135000.0
6  Janelle  52.0      F              CIO  230000.0

**Q23:**  Create a copy of `Q22` and save it as `Q23`.  Drop all rows that contain missing values from the `Q23` DataFrame.

In [75]:
# WRITE CODE HERE THAT REPRODUCES THE OUTPUT OF THE CELL BELOW
# BE CAREFUL NOT TO RUN THE CELL BELOW, OTHERWISE YOU WON'T BE ABLE TO SEE THE OUTPUT ANY MORE
# IF YOU NEED MORE CODE CELLS, YOU CAN ADD MORE BEFORE THE ANSWER CELL

Q23 = Q22.copy()
Q23

      name   age gender       profession    salary
0     John  25.0      M        Developer  100000.0
1     Jane  27.0      F          Analyst   80000.0
2    Billy  42.0      M            Admin   75000.0
3    Tracy  31.0      F   Data Scientist  110000.0
4    Emily  22.0      F  Project Manager       NaN
5    Lukas   NaN      M      ML Engineer  135000.0
6  Janelle  52.0      F              CIO  230000.0

In [76]:
Q23 = Q23.dropna()
Q23

      name   age gender      profession    salary
0     John  25.0      M       Developer  100000.0
1     Jane  27.0      F         Analyst   80000.0
2    Billy  42.0      M           Admin   75000.0
3    Tracy  31.0      F  Data Scientist  110000.0
6  Janelle  52.0      F             CIO  230000.0

In [ ]:
#ANSWER CELL: DO NOT RUN THIS CELL. YOUR ANSWER MUST MATCH THIS.

      name   age gender      profession    salary
0     John  25.0      M       Developer  100000.0
1     Jane  27.0      F         Analyst   80000.0
2    Billy  42.0      M           Admin   75000.0
3    Tracy  31.0      F  Data Scientist  110000.0
6  Janelle  52.0      F             CIO  230000.0

**Q24:** Make a copy of the `Q22` DataFrame and save it as `Q24`.  Add a new column called `departments` to the `Q24` DataFrame using the list below.

In [77]:
departments = ['IT','IT','Administration','IT','Communications','IT','Executive']

Q24 = Q22.copy()

In [78]:
# WRITE CODE HERE THAT REPRODUCES THE OUTPUT OF THE CELL BELOW
# BE CAREFUL NOT TO RUN THE CELL BELOW, OTHERWISE YOU WON'T BE ABLE TO SEE THE OUTPUT ANY MORE
# IF YOU NEED MORE CODE CELLS, YOU CAN ADD MORE BEFORE THE ANSWER CELL

Q24['departments'] = departments
Q24

      name   age gender       profession    salary     departments
0     John  25.0      M        Developer  100000.0              IT
1     Jane  27.0      F          Analyst   80000.0              IT
2    Billy  42.0      M            Admin   75000.0  Administration
3    Tracy  31.0      F   Data Scientist  110000.0              IT
4    Emily  22.0      F  Project Manager       NaN  Communications
5    Lukas   NaN      M      ML Engineer  135000.0              IT
6  Janelle  52.0      F              CIO  230000.0       Executive

In [ ]:
#ANSWER CELL: DO NOT RUN THIS CELL. YOUR ANSWER MUST MATCH THIS.

      name   age gender       profession    salary     departments
0     John  25.0      M        Developer  100000.0              IT
1     Jane  27.0      F          Analyst   80000.0              IT
2    Billy  42.0      M            Admin   75000.0  Administration
3    Tracy  31.0      F   Data Scientist  110000.0              IT
4    Emily  22.0      F  Project Manager       NaN  Communications
5    Lukas   NaN      M      ML Engineer  135000.0              IT
6  Janelle  52.0      F              CIO  230000.0       Executive

**Q25:** Make a copy of the `Q24` DataFrame and save it as `Q25`.  You heard back from HR that Emily's salary should equal the employee with the lowest salary. Fill this missing value in `Q25` with the minimum salary (use `fillna()` and `min()` instead of hard coding the salary).

In [79]:
# WRITE CODE HERE THAT REPRODUCES THE OUTPUT OF THE CELL BELOW
# BE CAREFUL NOT TO RUN THE CELL BELOW, OTHERWISE YOU WON'T BE ABLE TO SEE THE OUTPUT ANY MORE
# IF YOU NEED MORE CODE CELLS, YOU CAN ADD MORE BEFORE THE ANSWER CELL

Q25 = Q24.copy()
Q25

      name   age gender       profession    salary     departments
0     John  25.0      M        Developer  100000.0              IT
1     Jane  27.0      F          Analyst   80000.0              IT
2    Billy  42.0      M            Admin   75000.0  Administration
3    Tracy  31.0      F   Data Scientist  110000.0              IT
4    Emily  22.0      F  Project Manager       NaN  Communications
5    Lukas   NaN      M      ML Engineer  135000.0              IT
6  Janelle  52.0      F              CIO  230000.0       Executive

In [90]:
Q25['salary'] = Q25['salary'].fillna(Q25['salary'].min())
Q25

      name   age gender       profession    salary     departments
0     John  25.0      M        Developer  100000.0              IT
1     Jane  27.0      F          Analyst   80000.0              IT
2    Billy  42.0      M            Admin   75000.0  Administration
3    Tracy  31.0      F   Data Scientist  110000.0              IT
4    Emily  22.0      F  Project Manager   75000.0  Communications
5    Lukas   NaN      M      ML Engineer  135000.0              IT
6  Janelle  52.0      F              CIO  230000.0       Executive

In [ ]:
#ANSWER CELL: DO NOT RUN THIS CELL. YOUR ANSWER MUST MATCH THIS.

      name   age gender       profession    salary     departments
0     John  25.0      M        Developer  100000.0              IT
1     Jane  27.0      F          Analyst   80000.0              IT
2    Billy  42.0      M            Admin   75000.0  Administration
3    Tracy  31.0      F   Data Scientist  110000.0              IT
4    Emily  22.0      F  Project Manager   75000.0  Communications
5    Lukas   NaN      M      ML Engineer  135000.0              IT
6  Janelle  52.0      F              CIO  230000.0       Executive

**Q26:** Make a copy of `Q25` and save it as `Q26`.  Add Lukas' age of `54` to the `Q26` DataFrame.

In [97]:
# WRITE CODE HERE THAT REPRODUCES THE OUTPUT OF THE CELL BELOW
# BE CAREFUL NOT TO RUN THE CELL BELOW, OTHERWISE YOU WON'T BE ABLE TO SEE THE OUTPUT ANY MORE
# IF YOU NEED MORE CODE CELLS, YOU CAN ADD MORE BEFORE THE ANSWER CELL

Q26 = Q25.copy()
Q26.loc[Q26['name'] == 'Lukas', 'age'] = 54

In [98]:
Q26

      name   age gender       profession    salary     departments
0     John  25.0      M        Developer  100000.0              IT
1     Jane  27.0      F          Analyst   80000.0              IT
2    Billy  42.0      M            Admin   75000.0  Administration
3    Tracy  31.0      F   Data Scientist  110000.0              IT
4    Emily  22.0      F  Project Manager   75000.0  Communications
5    Lukas  54.0      M      ML Engineer  135000.0              IT
6  Janelle  52.0      F              CIO  230000.0       Executive

In [ ]:
#ANSWER CELL: DO NOT RUN THIS CELL. YOUR ANSWER MUST MATCH THIS.

      name   age gender       profession    salary     departments
0     John  25.0      M        Developer  100000.0              IT
1     Jane  27.0      F          Analyst   80000.0              IT
2    Billy  42.0      M            Admin   75000.0  Administration
3    Tracy  31.0      F   Data Scientist  110000.0              IT
4    Emily  22.0      F  Project Manager   75000.0  Communications
5    Lukas  54.0      M      ML Engineer  135000.0              IT
6  Janelle  52.0      F              CIO  230000.0       Executive

**Q27:** Sort the `Q26` DataFrame by the `age` column from youngest to oldest employee and save this as `Q27`.

In [106]:
# WRITE CODE HERE THAT REPRODUCES THE OUTPUT OF THE CELL BELOW
# BE CAREFUL NOT TO RUN THE CELL BELOW, OTHERWISE YOU WON'T BE ABLE TO SEE THE OUTPUT ANY MORE
# IF YOU NEED MORE CODE CELLS, YOU CAN ADD MORE BEFORE THE ANSWER CELL

Q27 = Q26.sort_values(['age'])
Q27

      name   age gender       profession    salary     departments
4    Emily  22.0      F  Project Manager   75000.0  Communications
0     John  25.0      M        Developer  100000.0              IT
1     Jane  27.0      F          Analyst   80000.0              IT
3    Tracy  31.0      F   Data Scientist  110000.0              IT
2    Billy  42.0      M            Admin   75000.0  Administration
6  Janelle  52.0      F              CIO  230000.0       Executive
5    Lukas  54.0      M      ML Engineer  135000.0              IT

In [ ]:
#ANSWER CELL: DO NOT RUN THIS CELL. YOUR ANSWER MUST MATCH THIS.

      name   age gender       profession    salary     departments
4    Emily  22.0      F  Project Manager   75000.0  Communications
0     John  25.0      M        Developer  100000.0              IT
1     Jane  27.0      F          Analyst   80000.0              IT
3    Tracy  31.0      F   Data Scientist  110000.0              IT
2    Billy  42.0      M            Admin   75000.0  Administration
6  Janelle  52.0      F              CIO  230000.0       Executive
5    Lukas  54.0      M      ML Engineer  135000.0              IT

**Q28:** Sort the `Q26` DataFrame in descending order by `salary` and save this as `Q28`.

In [108]:
# WRITE CODE HERE THAT REPRODUCES THE OUTPUT OF THE CELL BELOW
# BE CAREFUL NOT TO RUN THE CELL BELOW, OTHERWISE YOU WON'T BE ABLE TO SEE THE OUTPUT ANY MORE
# IF YOU NEED MORE CODE CELLS, YOU CAN ADD MORE BEFORE THE ANSWER CELL

Q28 = Q26.sort_values(['salary'], ascending= False)
Q28

      name   age gender       profession    salary     departments
6  Janelle  52.0      F              CIO  230000.0       Executive
5    Lukas  54.0      M      ML Engineer  135000.0              IT
3    Tracy  31.0      F   Data Scientist  110000.0              IT
0     John  25.0      M        Developer  100000.0              IT
1     Jane  27.0      F          Analyst   80000.0              IT
2    Billy  42.0      M            Admin   75000.0  Administration
4    Emily  22.0      F  Project Manager   75000.0  Communications

In [ ]:
#ANSWER CELL: DO NOT RUN THIS CELL. YOUR ANSWER MUST MATCH THIS.

      name   age gender       profession    salary     departments
6  Janelle  52.0      F              CIO  230000.0       Executive
5    Lukas  54.0      M      ML Engineer  135000.0              IT
3    Tracy  31.0      F   Data Scientist  110000.0              IT
0     John  25.0      M        Developer  100000.0              IT
1     Jane  27.0      F          Analyst   80000.0              IT
2    Billy  42.0      M            Admin   75000.0  Administration
4    Emily  22.0      F  Project Manager   75000.0  Communications

**Q29:** Using `value_counts()`, how many employees in the `Q28` DataFrame does each department have?  Save this as `Q29`.

In [110]:
# WRITE CODE HERE THAT REPRODUCES THE OUTPUT OF THE CELL BELOW
# BE CAREFUL NOT TO RUN THE CELL BELOW, OTHERWISE YOU WON'T BE ABLE TO SEE THE OUTPUT ANY MORE
# IF YOU NEED MORE CODE CELLS, YOU CAN ADD MORE BEFORE THE ANSWER CELL

Q29 = Q28['departments'].value_counts()
Q29

departments
IT                4
Executive         1
Administration    1
Communications    1
Name: count, dtype: int64

In [ ]:
#ANSWER CELL: DO NOT RUN THIS CELL. YOUR ANSWER MUST MATCH THIS.

IT                4
Administration    1
Communications    1
Executive         1
Name: departments, dtype: int64

**Q30:** Make a copy of the `Q28` DataFrame and save it as `Q30`.  Rename the `name` column in `Q30` to `employee_name`.

In [114]:
# WRITE CODE HERE THAT REPRODUCES THE OUTPUT OF THE CELL BELOW
# BE CAREFUL NOT TO RUN THE CELL BELOW, OTHERWISE YOU WON'T BE ABLE TO SEE THE OUTPUT ANY MORE
# IF YOU NEED MORE CODE CELLS, YOU CAN ADD MORE BEFORE THE ANSWER CELL

Q30 = Q28.copy()
Q30.rename(columns={'name': 'employee_name'}, inplace=True)
Q30

  employee_name   age gender       profession    salary     departments
6       Janelle  52.0      F              CIO  230000.0       Executive
5         Lukas  54.0      M      ML Engineer  135000.0              IT
3         Tracy  31.0      F   Data Scientist  110000.0              IT
0          John  25.0      M        Developer  100000.0              IT
1          Jane  27.0      F          Analyst   80000.0              IT
2         Billy  42.0      M            Admin   75000.0  Administration
4         Emily  22.0      F  Project Manager   75000.0  Communications

In [ ]:
#ANSWER CELL: DO NOT RUN THIS CELL. YOUR ANSWER MUST MATCH THIS.

  employee_name   age gender       profession    salary     departments
6       Janelle  52.0      F              CIO  230000.0       Executive
5         Lukas  54.0      M      ML Engineer  135000.0              IT
3         Tracy  31.0      F   Data Scientist  110000.0              IT
0          John  25.0      M        Developer  100000.0              IT
1          Jane  27.0      F          Analyst   80000.0              IT
2         Billy  42.0      M            Admin   75000.0  Administration
4         Emily  22.0      F  Project Manager   75000.0  Communications

Good work!